import { Injectable } from "@angular/core";
import { Item, Category } from "./models/eody.model";

@Injectable()
export class DataService {
    private currentTabIndex: number = 0;
    setTabIndex(idx: number): void {
        this.currentTabIndex = idx;
    }
    getActiveTab(): number {
        return this.currentTabIndex;
    }

    getItems(): Array<Item> {
        return [{
            id: 1,
            name: "Σεισμοί",
            cover: "~/app/assets/images/seismoi.png",
            images: [
                "~/app/assets/images/seismoi.png",
                "~/app/assets/images/seismoi.png",
                "~/app/assets/images/seismoi.png",
                "~/app/assets/images/seismoi.png",
                "~/app/assets/images/seismoi.png",
                "~/app/assets/images/seismoi.png"
            ],
            category: "",
            categoryTag: "#2D9CDB",
            price: "300.00",
            likes: 987,
            isLike: false,
            isFavorite: true,
            comments: 13,
            rating: "4.5",
            description: `<p>Ο σεισμός είναι φαινόμενο το οποίο εκδηλώνεται συνήθως χωρίς σαφή προειδοποίηση, δεν μπορεί να αποτραπεί και παρά τη μικρή χρονική διάρκεια του, μπορεί να προκαλέσει μεγάλες υλικές ζημιές στις ανθρώπινες υποδομές με επακόλουθα σοβαρούς τραυματισμούς και απώλειες ανθρώπινων ζωών.</p>
            <h4>1. Κίνδυνοι που προέρχονται από τους σεισμούς
            Κατά τη διάρκεια ενός σεισμού η κίνηση του εδάφους σπάνια αποτελεί άμεση αιτία θανάτων ή τραυματισμών. Τα περισσότερα ατυχήματα είναι τυχαία και προκαλούνται από:</h4><ul>
            <li>Καταρρεύσεις τμημάτων κτιρίων και από κομμάτια υλικών που πέφτουν (τούβλα, τοίχοι, γυψώματα, θωράκια στέγης, καπνοδόχοι, διακοσμητικά στοιχεία, πινακίδες κλπ.)</li>
            <li>Σπασμένα τζάμια κυρίως από ψηλά κτίρια</li>
            <li>Πτώση διαφόρων αντικειμένων, ανατροπές επίπλων, βιβλιοθηκών κλπ.</li>
            <li>Πτώσεις στύλων και ηλεκτροφόρων καλωδίων</li>
            <li>Πυρκαγιές που προκαλούνται από βραχυκυκλώματα, σπασμένες γραμμές καυσίμου αερίου κλπ.</li>
            <li>Κατολισθήσεις χωμάτων και βράχων</li>
            <li>Θαλάσσια κύματα που πιθανόν να φτάσουν στις παράκτιες περιοχές αρκετή ώρα μετά το σεισμό και κυρίως από πράξεις ανθρώπων που δημιουργεί ο πανικός.</li></ul>
            <h4>2. Τι μπορούμε να κάνουμε για να μειώσουμε τους κινδύνους από τους σεισμούς</h4><p>
            Υπάρχουν πολλές ενέργειες που μπορούμε να κάνουμε για να μειώσουμε τους κινδύνους από τους σεισμούς. Οι ενέργειες αυτές αναλύονται στη συνέχεια με αρκετή σαφήνεια.</p>
            <h4>2.1. Τι πρέπει να κάνουμε από τώρα:</h4><p>
            Πρέπει να ξέρουμε από πού και πως κλείνουν οι γενικοί διακόπτες του: Ηλεκτρικού ρεύματος, του καυσίμου αερίου και νερού ώστε μετά από σεισμό κλείνοντας τους να προλάβουμε ή να περιορίσουμε βραχυκυκλώματα ή επικίνδυνες διαρροές.</p><p>
            Πρέπει να υπάρχουν σε εμφανή θέση δίπλα ή πάνω στη συσκευή του τηλεφώνου τα χρήσιμα σε ώρα ανάγκης τηλέφωνα (Πυροσβεστικής Υπηρεσίας, Αστυνομίας, ΕΚΑΒ, κ.λ.π.)
            Πρέπει να έχουμε προμηθευτεί μερικά πράγματα που είναι απαραίτητα σε περίπτωση έκτακτης ανάγκης (φάρμακα, φορητό ραδιόφωνο, σφυρίχτρα, φακό).
            Πρέπει να βάλουμε σε χαμηλές θέσεις τα μεγάλα και βαριά αντικείμενα και όσα μπορούν εύκολα να σπάσουν. Να στερεώσουμε γερά τα ράφια και τις βιβλιοθήκες. Να στηρίζουμε καλά τα ψηλά ή βαριά αντικείμενα ή έπιπλα. Να μη κρεμάσουμε βαριά πράγματα στους τοίχους.
            Όλοι οι μαθητές και οι γονείς τους σε συνεννόηση με τους δασκάλους, πρέπει να καθορίσουν σημεία συνάντησης μετά από μεγάλο σεισμό.</p>
            <h4>2.2. Τι πρέπει να κάνουμε την ώρα του σεισμού:</h4><p>
            Αν βρεθούμε έξω από ένα κτίριο, μένουμε έξω. Αν βρεθούμε μέσα μένουμε μέσα. Στους σεισμούς οι περισσότεροι τραυματισμοί γίνονται την ώρα που μπαίνουμε ή βγαίνουμε από κτίρια, από τον πανικό και από γκρεμίσματα που πέφτουν.</p><p>
            Αν βρεθούμε μέσα σε ένα κτίριο, στεκόμαστε μακριά από έπιπλα ή αντικείμενα που μπορούν να πέσουν. Για να προστατευτούμε από πτώσεις μπαίνουμε κάτω από ένα τραπέζι, γραφείο κλπ.</p><p>
            Δεν βγαίνουμε στα μπαλκόνια.</p><p>
            Αποφεύγουμε να μένουμε κοντά στις προσόψεις του κτιρίου και στεκόμαστε δίπλα στην πιο μεγάλη κολόνα του διαμερίσματος ή του γραφείου. Σε περίπτωση που το κλιμακοστάσιο του κτιρίου περιβάλλεται από τοιχία οπλισμένου σκυροδέματος στεκόμαστε κοντά σε αυτά.</p><p>
            Μένουμε μακριά από τα παράθυρα γιατί κινδυνεύουμε από σπασμένα τζάμια.</p><p>
            Δεν τρέχουμε προς την έξοδο βιαστικά, γιατί αν όλοι κάνουν το ίδιο θα δημιουργηθεί πανικός και πιθανόν τραυματισμοί. Δεν χρησιμοποιούμε ποτέ ασανσέρ γιατί κινδυνεύουμε να εγκλωβιστούμε σε περίπτωση που διακοπεί το ηλεκτρικό ρεύμα.</p><p>
            Αν βρεθούμε έξω μένουμε μακριά από κτίρια και ηλεκτροφόρα καλώδια. Μεγάλος είναι ο κίνδυνος έξω από τις εισόδους των κτιρίων και κοντά στους εξωτερικούς τοίχους από κομμάτια υλικών που πέφτουν.</p><p>
            Δεν τρέχουμε στους δρόμους, κινούμαστε ήρεμα προς ένα ανοιχτό χώρο.</p><p>
            Δεν πλησιάζουμε τις ακτές. Ύστερα από ένα σφοδρό σεισμό μπορεί να δημιουργηθούν κύματα με μεγάλη ταχύτητα και ύψος.</p><p>
            Αν κυκλοφορούμε με αυτοκίνητα σταματάμε σε μέρος ασφαλές και μένουμε μέσα σ’ αυτό. Αν συνεχίσουμε υπάρχει κίνδυνος να χτυπήσει το αυτοκίνητο σε πεσμένα αντικείμενα σε ηλεκτροφόρα καλώδια, σε λακκούβες κατεστραμμένων οδοστρωμάτων κλπ.</p><p>
            Αν οι μαθητές βρεθούν μέσα σε σχολείο, πρέπει να μπουν αμέσως κάτω από τα θρανία. Έτσι είναι περισσότερο προφυλαγμένοι. Αν βγουν έξω βιαστικά και μαζικά υπάρχει κίνδυνος να σημειωθούν τραυματισμοί ανάμεσα στους μαθητές, ενώ το σχολείο μπορεί να μην πάθει ζημιά. Μετά το σεισμό θα βγουν ήρεμα και κανονικά.</p>
            <h4>2.3 Τι πρέπει να κάνουμε μετά το σεισμό:</h4><p>
            Εξετάζουμε προσεκτικά τις παροχές του ηλεκτρικού ρεύματος, του καυσίμου αερίου και του νερού.Αν παρατηρήσουμε βλάβη κλείνουμε τους κεντρικούς διακόπτες.</p><p>
            Αν κάπου πιάσει φωτιά την σβήνουμε αμέσως.</p><p>
            Ψάχνουμε για τραυματισμένους.</p><p>
            Δεν δοκιμάζουμε να μετακινήσουμε βαριά τραυματισμένα άτομα, παρά μόνο αν βρίσκονται σε άμεσο κίνδυνο να τραυματιστούν περισσότερο.</p><p>
            Δεν αγγίζουμε ηλεκτροφόρα καλώδια πεσμένα στο έδαφος, ούτε τα αντικείμενα που ακουμπούν τα καλώδια, υπάρχει κίνδυνος ηλεκτροπληξίας.</p><p>
            Καθαρίζουμε αμέσως τα υπάρχοντα σπασμένα μπουκάλια από φάρμακα και επικίνδυνα χημικά προϊόντα.</p><p>
            Δεν χρησιμοποιούμε το τηλέφωνό μας παρά μόνο για νοσοκομειακή βοήθεια.</p><p>
            Ανοίγουμε το ραδιόφωνό μας και ακούμε τις ειδήσεις για οδηγίες και πληροφορίες.</p><p>
            Μετά από ένα ισχυρό σεισμό ακολουθούν και μετασεισμοί, που πολλές φορές είναι αρκετά δυνατοί και μπορούν να προξενήσουν ζημιές. Γι αυτό μένουμε μακριά από κτίρια που έχουν πάθει βλάβες ή αν είναι απαραίτητο να μπούμε μέσα σ’ αυτά δεν μένουμε πολλή ώρα. Οι μετασεισμοί μπορεί να προξενήσουν μεγαλύτερες βλάβες ή και την κατάρρευσή τους.</p>
            <h4>2.4 Η προσωπική μας συμπεριφορά σε περίπτωση σεισμού:</h4><p>
            Οι ώρες που ακολουθούν ύστερα από ένα βλαβερό σεισμό είναι πολύ κρίσιμες. Είναι οι ώρες που απαιτούν ψυχραιμία, θάρρος και περίσκεψη.</p><p>
            Πρέπει να κρατηθούμε ήρεμοι. Ο πανικός δημιουργεί θύματα. Σκεφτόμαστε όλες τις συνέπειες που μπορεί να έχει κάθε ενέργειά μας.</p><p>
            Μετά από σεισμό ακολουθούμε πιστά τις οδηγίες των αρχών και των κρατικών μέσων ενημέρωσης.</p><p>
            Δε δίνουμε πίστη σε φημολογίες και δεν τις διαδίδουμε. Συχνά δημιουργείται σύγχυση και πανικός.</p><p>
            Ανταποκρινόμαστε στις εκκλήσεις για εθελοντική βοήθεια, αλλά δεν πηγαίνουμε στις σεισμόπληκτες περιοχές χωρίς να μας το ζητήσουν.</p><p>
            Είναι αναγκαίο να συνεργαζόμαστε με τους υπεύθυνους για την ασφάλεια του κοινού.</p><p>
            Είναι απαραίτητο να συνεργαζόμαστε μεταξύ μας για να προλάβουμε πυρκαγιές και για να βοηθήσουμε τραυματισμένους, ηλικιωμένους, αρρώστους και παιδιά.</p><p>
            Δεν ξεχνάμε ποτέ ότι ο πιο αποτελεσματικός τρόπος για να προστατευτούμε σε περίπτωση ισχυρού σεισμού είναι να είμαστε προετοιμασμένοι και κατατοπισμένοι.</p>`
        },
        {
            id: 2,
            name: "Κατολισθήσεις / Καθιζήσεις",
            cover: "~/app/assets/images/katolisthiseis_1.png",
            images: [
                "~/app/assets/images/katolisthiseis_1.png",
                "~/app/assets/images/katolisthiseis_1.png",
                "~/app/assets/images/katolisthiseis_1.png",
                "~/app/assets/images/katolisthiseis_1.png",
                "~/app/assets/images/katolisthiseis_1.png",
                "~/app/assets/images/katolisthiseis_1.png"
            ],
            category: "",
            categoryTag: "#e4ce0d",
            price: "230.00",
            likes: 891,
            isLike: true,
            isFavorite: true,
            comments: 7,
            rating: "4.0",
            description: `<h3>ΕΤΟΙΜΟΤΗΤΑ ΓΙΑ ΚΑΤΟΛΙΣΘΗΣΕΙΣ</h3>
<p>Περιοχές που ο κίνδυνος εκδήλωσης κατολίσθησης είναι αυξημένος</p><p>
Σε περιοχές υφιστάμενων παλαιότερων κατολισθήσεων.</p><p>
Πάνω ή στη βάση απότομων πρανών ή κλιτύων.</p><p>
Στη βάση ή την κορυφή επιχωμάτων και εκσκαφών.</p><p>
Η ισχυρή ανατάραξη του εδάφους που προκαλείται από τους σεισμούς μπορεί να προκαλέσει κατολισθήσεις ή να εντείνει τις συνέπειες τους.</p><p>
Ενέργειες πριν την εκδήλωση της κατολίσθησης</p><p>
Οι κατολισθήσεις συμβαίνουν συνήθως σε περιοχές που έχουν συμβεί και στο παρελθόν. Ζητήστε πληροφορίες για τις κατολισθήσεις στην περιοχή σας, και ενδεχομένως ζητήστε μια λεπτομερή πραγματογνωμοσύνη της περιοχής του  ακινήτου σας.</p><p>
Εάν η κατοικία σας βρίσκεται εντός περιοχής με αυξημένο κίνδυνο για την εκδήλωση κατολίσθησης ελαχιστοποιείστε τον κίνδυνο πραγματοποιώντας φύτευση των πρανών που βρίσκονται εντός της ιδιοκτησίας σας και κατασκευάζοντας τοίχους αντιστήριξης.</p><p>
Τι να κάνετε αν υποψιάζεστε ότι υπάρχει άμεσος κίνδυνος κατολισθήσεων</p><p>
Επικοινωνήστε με τις τοπικές Αρχές, Πυροσβεστική, Αστυνομία ή Διεύθυνση Τεχνικών Έργων. Οι τοπικοί φορείς είναι οι πλέον κατάλληλοι να εκτιμήσουν έναν ενδεχόμενο κίνδυνο.</p><p>
Ενημερώστε τους γείτονές σας. Ενδέχεται να μην έχουν επίγνωση των πιθανών κινδύνων.</p><p>
Αν βρίσκεστε σε περιοχές επικίνδυνες για κατολισθήσεις και λασποροές, ενημερωθείτε για τις πιθανές οδούς διαφυγής. Θυμηθείτε παρόλα αυτά ότι η οδήγηση κατά τη διάρκεια έντονης βροχόπτωσης είναι πολύ επικίνδυνη.</p><p>
Ενημερωθείτε από τα μέσα μαζικής ενημέρωσης και το διαδίκτυο για προειδοποιήσεις σχετικές με φαινόμενα έντονων ή παρατεταμένων βροχοπτώσεων. Μετά από περιόδους παρατεταμένων βροχοπτώσεων αυξάνεται ο κίνδυνος εκδήλωσης κατολισθήσεων.</p><p>
Ενέργειες κατά την διάρκεια εκδήλωσης κατολισθήσεων</p><p>

Απομακρυνθείτε το ταχύτερο δυνατό από την περιοχή εκδήλωσης της κατολίσθησης.</p><p>
Αν παραμείνετε στο σπίτι, μετακινηθείτε σε ψηλότερους ορόφους.</p><p>
Εάν είναι αδύνατο να απομακρυνθείτε καθίστε στο πάτωμα σε εμβρυακή στάση και προστατέψτε το κεφάλι σας.</p><p>
Να είστε έτοιμοι να μετακινηθείτε γρήγορα. Δώστε προτεραιότητα στην ασφάλεια του εαυτού σας και όχι των υπαρχόντων σας.</p><p>
Μείνετε σε ετοιμότητα και επαγρύπνηση όταν οδηγείτε. Τα κράσπεδα κατά μήκος των οδών είναι ιδιαίτερα ευαίσθητα σε κατολισθήσεις και καταπτώσεις βράχων. Παρατηρείτε με προσοχή το δρόμο για πιθανά σημάδια καθίζησης, κατάρρευσης, καταπτώσεις βράχων κλπ.</p>
 
<h4>Ενέργειες μετά την εκδήλωση κατολισθήσεων</h4>
<p>Μείνετε μακριά από την περιοχή της κατολίσθησης. Μπορεί να υπάρχει κίνδυνος εκδήλωσης νέας κατολίσθησης.</p><p>
Παρακολουθείτε τους τοπικούς ραδιοφωνικούς ή τηλεοπτικούς σταθμούς για τις τελευταίες πληροφορίες σχετικά με την αντιμετώπιση των έκτακτων αναγκών που προέκυψαν από την εκδήλωση της κατολίσθησης.</p><p>
Ελέγξτε για τραυματίες και παγιδευμένα άτομα περιμετρικά του χώρου εκδήλωσης της κατολίσθησης, χωρίς να εισέλθετε σε αυτόν. Κατευθύνεται τα σωστικά συνεργεία στις θέσεις των παγιδευμένων.</p><p>
Ελέγξτε για βλάβες σε δίκτυα κοινής ωφέλειας, οδικό και σιδηροδρομικό δίκτυο και αναφέρεται τις βλάβες στις αρμόδιες Αρχές.</p><p>
Ελέγξτε για ζημιές τα κρίσιμα σημεία για την στατικότητα του σπιτιού σας.</p>`
        },
        {
            id: 3,
            name: "Δασικές πυρκαγιές",
            cover: "~/app/assets/images/fires.png",
            images: [
                "~/app/assets/images/fires.png",
                "~/app/assets/images/fires.png",
                "~/app/assets/images/fires.png",
                "~/app/assets/images/fires.png"
            ],
            category: "",
            categoryTag: "#27AE60",
            price: "300.00",
            likes: 730,
            isLike: true,
            isFavorite: true,
            comments: 11,
            rating: "4.0",
            description: `<h3>Πυρκαγιά</h3>
            <h4>1. Αν βρισκόμαστε στην ύπαιθρο</h4><ul>
            <li>Δεν καίμε σκουπίδια ή ξερά χόρτα και κλαδιά σε υπαίθριους χώρους κατά τους θερινούς μήνες.</li>
            <li>Δεν ανάβουμε υπαίθριες ψησταριές στα δάση ή σε χώρους που υπάρχουν ξερά χόρτα το καλοκαίρι.</li>
            <li>Αποφεύγουμε τις εργασίες που ενδέχεται να προκαλέσουν πυρκαγιά (π.χ. οξυγονοκολλήσεις, χρήση τροχού κτλ.).</li>
            <li>Δεν πετάμε αναμμένα τσιγάρα και δεν αφήνουμε σκουπίδια σε δάση.</li>
            <li>Σεβόμαστε τις απαγορεύσεις πρόσβασης στα δάση σε περιόδους υψηλού κινδύνου.</li>
            <li>Κατά την αντιπυρική περίοδο απαγορεύεται, λόγω αυξημένης επικινδυνότητας, η οποιαδήποτε χρήση φωτιάς στην ύπαιθρο.</li></ul>
            <h4>2. Αν η πυρκαγιά πλησιάζει στο σπίτι μας</h4><ul>
            <li>Διατηρούμε την ψυχραιμία μας.</li>
            <li>Μεταφέρουμε όλα τα εύφλεκτα υλικά από τον περίγυρο του κτιρίου σε κλειστούς και προφυλαγμένους χώρους.</li>
            <li>Κλείνουμε όλες τις διόδους (καμινάδες, παράθυρα, πόρτες κλπ.) έτσι ώστε να μην διεισδύσουν οι καύτρες στο εσωτερικό του σπιτιού.</li>
            <li>Κλείνουμε τις παροχές φυσικού αερίου και υγρών καυσίμων μέσα και έξω από το σπίτι.</li>
            <li>Μαζεύουμε τις τέντες στα μπαλκόνια και στα παράθυρα.</li>
            <li>Διευκολύνουμε την πρόσβαση πυροσβεστικών οχημάτων ανοίγοντας την πόρτα του κήπου.</li>
            <li>Τοποθετούμε σκάλα στην εξωτερική πλευρά του σπιτιού, αντίθετα από την κατεύθυνση της πυρκαγιάς ώστε να υπάρχει η δυνατότητα άμεσης πρόσβασης στη στέγη.</li>
            <li>Συνδέουμε τους σωλήνες ποτίσματος και τους απλώνουμε ώστε να καλύπτεται η περίμετρος του σπιτιού.</li>
            <li>Αν η ορατότητα είναι μειωμένη, ανάβουμε τα εσωτερικά και τα εξωτερικά φώτα του για να γίνεται ορατό μέσα από τους καπνούς.</li></ul>
            <h4>3. Μόλις περάσει η πυρκαγιά και μπορούμε να βγούμε με ασφάλεια από το σπίτι</h4><ul>
            <li>Βγαίνουμε από το σπίτι και σβήνουμε τις μικροεστίες που απομένουν.</li>
            <li>Ελέγχουμε για τουλάχιστον 48 ώρες, ανά τακτά χρονικά διαστήματα, την περίμετρο και τους εξωτερικούς χώρους του σπιτιού για το ενδεχόμενο αναζωπυρώσεων.</li></ul>
            <h4>4. Αν η πυρκαγιά έχει φτάσει στο σπίτι μας</h4><ul>
            <li>Δεν εγκαταλείπουμε το κτίριο εκτός αν η διαφυγή μας είναι πλήρως εξασφαλισμένη.</li>
            <li>Δεν μπαίνουμε μέσα σε αυτοκίνητο. Η πιθανότητα επιβίωσης σε ένα σπίτι κατασκευασμένο από άφλεκτα υλικά είναι πολύ μεγαλύτερη από εκείνη σε ένα αυτοκίνητο\<li>που βρίσκεται σε καπνούς και φλόγες.</li></ul>
            <h4>5. Αν παραμείνουμε στο σπίτι</h4><ul>
            <li>Κλείνουμε καλά τις πόρτες και τα παράθυρα.</li>
            <li>Φράζουμε τις χαραμάδες με βρεγμένα πανιά για να μην μπει μέσα ο καπνός.</li>
            <li>Απομακρύνουμε τις κουρτίνες από τα παράθυρα.</li>
            <li>Μεταφέρουμε στο εσωτερικό των δωματίων τα έπιπλα που βρίσκονται κοντά στα παράθυρα και τις εξωτερικές πόρτες</li>
            <li>Κλείνουμε τις ενδιάμεσες πόρτες για να επιβραδύνουμε την εξάπλωση της πυρκαγιάς.</li>
            <li>Γεμίζουμε την μπανιέρα, τους νιπτήρες και τους κουβάδες με εφεδρικό νερό.</li>
            <li>Συγκεντρωνόμαστε όλοι μαζί σε ένα δωμάτιο.</li>
            <li>Φροντίζουμε να υπάρχει φακός και εφεδρικές μπαταρίες μαζί μας σε περίπτωση διακοπής ηλεκτρικού ρεύματος.</li>
            <li>Αν το σπίτι μας είναι ξύλινο αναζητάμε καταφύγιο σε κτιστό σπίτι.</li>
            <li>Αν διαταχθεί εκκένωση της περιοχής ακολουθούμε πιστά τις οδηγίες των Αρχών και τις διαδρομές που θα μας δοθούν.</li></ul>`
        },
        {
            id: 5,
            name: "Απινιδωτές",
            cover: "~/app/assets/images/zoll-aed-plus.jpg",
            images: [
                "~/app/assets/images/zoll-aed-plus1.jpg",
                "~/app/assets/images/zoll-aed-plus2.jpg",
                "~/app/assets/images/zoll-aed-plus3.jpg",
                "~/app/assets/images/zoll-aed-plus1.jpg",
                "~/app/assets/images/zoll-aed-plus2.jpg",
            ],
            category: "",
            categoryTag: "#2D9CDB",
            price: "300.00",
            likes: 987,
            isLike: false,
            isFavorite: true,
            comments: 13,
            rating: "4.5",
            description: `<h3>Σημεία & Οδηγίες Χρήσης</h3>

<p>Σημεία εγκατεστημένων απινιδωτών:</p>
<p>1. Δημαρχείο Κορυδαλλού - Γρ. Λαμπράκη 240 </p>
<p>2. Κλειστό Γήπεδο "Θεόδωρος Πούτος" - Σολωμού 80</p>
<p>3. Κλειστό Γήπεδο</p>
<p>4. ΕΑΚ Κορυδαλλού- Πλαταιών</p>
<p>5. Δημοτικό Γυμναστήριο - Κουντουριώτου 25</p>

            <h4>Οδηγίες Χρήσης Απινιδωτή</h4>
            <p>1. Βεβαιώσου ότι είναι ασφαλές να προσεγγίσεις</p>
            <p>2. Έλεγξε αν το θύμα ανταποκρίνεται</p>
            <ul>
                <li>Κούνησε μαλακά τους ώμους</li>
                <li>Ρώτησε δυνατά: Είστε καλά;<li>
            </ul>
            <p>3. Εάν δεν ανταποκρίνεται</p>
            <ul>
                <li>Τοποθέτησε το χέρι στο μέτωπο του, γύρε το κεφάλι προς τα πίσω με τα δάκτυλα του άλλου χεριού κάτω από το πηγούνι ανύψωσέ το</li>
                <li>Έλεγξε για αναπνοή: ΒΛΕΠΩ, ΑΚΟΥΩ, ΑΙΣΘΑΝΟΜΑΙ</li>
            <p>Αν η αναπνοή δεν είναι φυσιολογική</p>
            <ul>
                <li>Κάλεσε 166 και ανέφερε ότι το θύμα δεν αναπνέει, δήλωσε το όνομά σου και την τοποθεσία</li>
                <li>Αν κάποιος έχει έρθει να βοηθήσει, ζήτησε να καλέσει το ασθενοφόρο και να φέρει τον Αυτόματο Εξωτερικό Απινιδωτή (ΑΕΑ)</li>
            </ul>
            <p>Συμπίεσε</p>
            <ul>
                <li>Τοποθέτησε την παλάμη του ενός χεριού στο κέντρο του θώρακα,  το άλλο χέρι από πάνω και πλέξε τα δάκτυλά σου</li>
                <li>Πίεσε δυνατά και γρήγορα τον θώρακα στο ρυθμό του “Stayin Alive”,  μέχρι να είναι διαθέσιμος ΑΕΑ ή μέχρι να φτάσει το ασθενοφόρο</li>
                <li>Αν είσαι εκπαιδευμένος δώσε 2 εμφυσήσεις για κάθε 30 συμπιέσεις, αλλιώς συνέχισε μόνο συμπιέσεις στο θώρακα</li>
            </ul>
            <p>Απινίδωσε</p>
            <ul>
                <li>Ενεργοποίησε τον ΑΕΑ, μόλις φτάσει και ακολούθησε τις οδηγίες</li>
                <li>Τοποθέτησε το ένα αυτοκόλλητο ηλεκτρόδιο κάτω από την αριστερή μασχάλη και το άλλο κάτω από τη δεξιά κλείδα, δίπλα στο στέρνο</li>
            </ul>
            <p>Εάν ενδείκνυται απινίδωση</p>
            <ul>
                <li>Βεβαιώσου ότι κανείς δεν ακουμπάει το θύμα και χορήγησε απινίδωση</li>
                <li>Συνέχισε ΚΑΡΠΑ, εκτός και εάν είσαι βέβαιος ότι το θύμα ξεκινά να αναπνέει φυσιολογικά</li>
            </ul>
            <p>Εάν δεν ενδείκνυται απινίδωση</p>
            <ul>
                <li>Συνέχισε ΚΑΡΠΑ, εκτός και εάν είσαι βέβαιος ότι το θύμα ξεκινά να αναπνέει φυσιολογικά</li>
            </ul>
            <p>Καθώς φτάνει το ασθενοφόρο συνέχισε, μέχρι να σου πουν να σταματήσεις</p>
            
            <p>Αν η αναπνοή είναι φυσιολογική</p>
            <ul>
                <li>Τοποθέτησε το θύμα σε πλάγια θέση ανάνηψης</li>
                <li>Κάλεσε το 166, στείλε κάποιον να φέρει ΑΕΑ</li>
                <li>Συνέχισε να εκτιμάς ότι η αναπνοή παραμένει φυσιολογική</li>
            </ul>
            `
        },
        {
            id: 6,
            name: "Σημεία Ασύρματης Πρόσβασης",
            cover: "~/app/assets/images/wifi.png",
            images: [
                "~/app/assets/images/wifidimarxio1.jpg",
                "~/app/assets/images/wifidimarxio4.jpg",
                "~/app/assets/images/wifidimarxio5.png",
                "~/app/assets/images/wifidimarxio2.jpg",
                "~/app/assets/images/wifidimarxio3.jpg",

            ],
            category: "",
            categoryTag: "#2D9CDB",
            price: "300.00",
            likes: 987,
            isLike: false,
            isFavorite: true,
            comments: 13,
            rating: "4.5",
            description: `<h3>Σημεία Ασύρματης Πρόσβασης</h3>
            <p>Ο Δήμος Κορυδαλλού ενσωματώνει στη καθημερινή λειτουργία του τις νέες Τεχνολογίες Πληροφορικής ώστε να εξυπηρετεί όλο και πιο αποτελεσματικά τους δημότες και τις επιχειρήσεις.</p>
            <p>Σε αυτό το πλαίσιο, στο Δημαρχείο Κορυδαλλού έχει εγκατασταθεί και παρέχεται ελεύθερη ασύρματη πρόσβαση στο διαδίκτυο, όπου οι επισκέπτες μπορούν να συνδεθούν μέσω wifi στο κινητό, στο tablet ή στο laptop τους.</p>
            <p>Στο επόμενο χρονικό διάστημα η ελεύθερη πρόσβαση σε υπηρεσίες ασύρματου δικτύου θα επεκταθεί και σε άλλα σημεία της πόλης μας καθώς ο Δήμος Κορυδαλλού διεκδίκησε και εξασφάλισε χρηματοδότηση, κατόπιν υποβολής αιτήματος στην πρόσκληση της Ευρωπαϊκής Ένωσης για την υλοποίηση της δράσης WiFi4EU, με στόχο την ανάπτυξη των ευρυζωνικών υποδομών και του ασύρματου δικτύου υψηλών ταχυτήτων για τους δημότες και τους επισκέπτες του δήμου.</p>
            `
        },
        {
            id: 7,
            name: "Πλημμύρα",
            cover: "~/app/assets/images/plimmires.png",
            images: [
                "~/app/assets/images/plimmires.png",
                "~/app/assets/images/plimmires.png",
                "~/app/assets/images/plimmires.png",
                "~/app/assets/images/plimmires.png",
                "~/app/assets/images/plimmires.png",

            ],
            category: "",
            categoryTag: "#2D9CDB",
            price: "300.00",
            likes: 987,
            isLike: false,
            isFavorite: true,
            comments: 13,
            rating: "4.5",
            description:`<p>Αν κατοικείτε σε περιοχή που κατά το παρελθόν είχε προβλήματα με πλημμύρες</p>
            <p>Σε περίπτωση που ενημερωθείτε για την εκδήλωση έντονης βροχόπτωσης στην περιοχή σας:</p>
            <p>Βεβαιωθείτε ότι τα φρεάτια έξω από το σπίτι σας δεν είναι φραγμένα και οι υδρορροές λειτουργούν κανονικά.
            Περιορίστε τις μετακινήσεις σας και αποφύγετε την εργασία και την παραμονή σε υπόγειους χώρους.</p>
            <h4>ΚΑΤΑ ΤΗ ΔΙΑΡΚΕΙΑ ΤΗΣ ΠΛΗΜΜΥΡΑΣ</h4>
            <p>Αν είστε μέσα σε κτίριο</p><p>
            Εγκαταλείψτε υπόγειους χώρους και μετακινηθείτε σε ασφαλές υψηλό σημείο.</p><p>
            Αν βρίσκεστε σε ανοικτό χώρο</p><p>
            Μην διασχίσετε χείμαρρο πεζή ή με αυτοκίνητο.</p><p>
            Μείνετε μακριά από ηλεκτροφόρα καλώδια.</p><p>
            Εγκαταλείψτε το αυτοκίνητό σας αν έχει ακινητοποιηθεί καθώς ενδέχεται να παρασυρθεί ή να πλημμυρίσει.</p><p>
            Μην πλησιάζετε σε περιοχές όπου έχουν σημειωθεί κατολισθήσεις.</p>
            <h4>ΜΕΤΑ ΤΗΝ ΠΛΗΜΜΥΡΑ</h4>
            <p>Αν βρίσκεστε σε ανοικτό χώρο</p><p>
            Μείνετε μακριά από περιοχές που έχουν πλημμυρίσει ή είναι επικίνδυνες να ξαναπλημμυρίσουν τις επόμενες ώρες.</p><ul>
            <li>η πλημμύρα ενδέχεται να έχει μεταβάλει τα χαρακτηριστικά γνώριμων περιοχών και τα νερά να έχουν παρασύρει μέρη του δρόμου, των πεζοδρομίων κλπ.</li>
            <li>εγκυμονούν κίνδυνοι από σπασμένα οδοστρώματα, περιοχές με επικίνδυνη κλίση, λασποροές κλπ.</li>
            <li>τα νερά ενδέχεται να είναι μολυσμένα αν έχουν παρασύρει μαζί τους απορρίμματα, αντικείμενα και νεκρά ζώα.</li></ul><p>
            Προσέξτε να μην εμποδίζετε τα συνεργεία διάσωσης.</p><p>
            Μην πλησιάζετε σε περιοχές που έχουν σημειωθεί κατολισθήσεις και πτώσεις βράχων.</p><p>
            Ελέγξτε αν το σπίτι ή ο χώρος εργασίας σας κινδυνεύει από πτώση βράχων.</p><p>
            Αν πρέπει οπωσδήποτε να βαδίσετε ή να οδηγήσετε σε περιοχές που έχουν πλημμυρίσει</p><p>
            Προσπαθήστε να βρείτε σταθερό έδαφος.</p><p>
            Αποφύγετε νερά που ρέουν.</p><p>
            Αν βρεθείτε μπροστά σε δρόμο που έχει πλημμυρίσει σταματήστε και αλλάξτε κατεύθυνση.</p><p>
            Αποφύγετε τα λιμνάζοντα νερά. Ενδέχεται να αποτελέσουν καλούς αγωγούς ηλεκτρικού ρεύματος καθώς κρύβουν υπόγεια καλώδια ή διαρροές από εγκαταστάσεις.
            Ακολουθείστε πιστά τις οδηγίες των αρμόδιων Αρχών.</p><p>
            <h4>ΤΙ ΝΑ ΚΑΝΕΤΕ ΚΑΤΑ ΤΗΝ ΑΠΟΚΑΤΑΣΤΑΣΗ ΤΩΝ ΖΗΜΙΩΝ</h4><p>
            Πριν αρχίσετε τις διαδικασίες αποκατάστασης</p><p>
            Θυμηθείτε ότι οι κίνδυνοι από την πλημμύρα δεν υποχωρούν αμέσως μετά την απόσυρση των υδάτων.</p><p>
            Βεβαιωθείτε από τις Αρχές ότι η περιοχή που βρίσκεται το σπίτι ή ο χώρος εργασίας σας είναι πλέον ασφαλής και κατόπιν επιστρέψτε σε αυτήν ειδικά αν έχει προηγηθεί εκκένωση.</p><p>
            Κλείστε την τροφοδοσία του ηλεκτρικού ρεύματος, ακόμα και αν στην περιοχή σας έχει διακοπεί το ηλεκτρικό ρεύμα.</p><p>
            Κλείστε την παροχή νερού, για το ενδεχόμενο βλάβης στο δίκτυο ύδρευσης.</p><p>
            Για να εξετάσετε ένα κτίριο που έχει πλημμυρίσει</p><p>
            Φορέστε κλειστά παπούτσια ώστε να αποφύγετε τραυματισμούς από αντικείμενα ή ανωμαλίες στο έδαφος που κρύβουν τα νερά.</p><p>
            Εξετάστε τους τοίχους, τις πόρτες, τις σκάλες και τα παράθυρα.</p><p>
            Εξετάστε τα δίκτυα του ηλεκτρικού ρεύματος, ύδρευσης και αποχέτευσης.</p>`
        }

        ];
    }

    getCategories(): Array<Category> {
        return [
            {
                cover: "~/app/assets/images/food/burger640.jpg",
                category: "BURGER",
                count: "13",
            },
            {
                cover: "~/app/assets/images/food/pancake640.jpg",
                category: "PANCAKE",
                count: "5",
            },
            {
                cover: "~/app/assets/images/food/cake640.jpg",
                category: "CAKE",
                count: "9",
            },
            {
                cover: "~/app/assets/images/food/beer640.jpg",
                category: "BEER",
                count: "7",
            }
        ];
    }
}

export class KorydallosBoundaries {
    static getData() {
        return `
     {
        id: 1,
fillColor: new Color("red"),
fillOpacity: 0.7,


strokeColor: new Color("green"),
strokeWidth: 8,
strokeOpacity: 0.5,
points: [
{ lat: 23.649157, lng: 37.9984944  },{lat: 23.6490701, lng: 37.9988487 }, { lat:23.648642, lng: 37.9991877 }, { lat:23.6482772, lng: 37.9995259 }, { lat:23.6478695, lng: 37.999881 }, { lat:23.6474677, lng: 38.0002212 }, { lat:23.6468825, lng: 38.0005742 }, { lat:23.646625, lng: 38.0007433 }, { lat:23.6463675, lng: 38.0010477 }, { lat:23.645654, lng: 38.0029854 }, { lat:23.6438999, lng: 38.0033134 }, { lat:23.6437282, lng: 38.0032965 }, { lat:23.642312, lng: 38.0029583 }, { lat:23.6402521, lng: 38.0026878 }, { lat:23.640016, lng: 38.0026878 }, { lat:23.6396512, lng: 38.0027724 }, { lat:23.6392865, lng: 38.0028062 }, { lat:23.6389431, lng: 38.0028062 }, { lat:23.6385354, lng: 38.0028231 }, { lat:23.6383423, lng: 38.0029414 }, { lat:23.6380419, lng: 38.0030936 }, { lat:23.6377115, lng: 38.0031773 }, { lat:23.6365849, lng: 38.0031705 }, { lat:23.6363468, lng: 38.0035332 }, { lat:23.6359176, lng: 38.0034656 }, { lat:23.6353812, lng: 38.0032796 }, { lat:23.6350164, lng: 38.0030598 }, { lat:23.6332139, lng: 38.0030429 }, { lat:23.6321196, lng: 38.0036854 }, { lat:23.6318192, lng: 38.0024173 }, { lat:23.6307506, lng: 38.0013427 }, { lat:23.6290297, lng: 38.0006419 }, { lat:23.6287078, lng: 38.0004728 }, { lat:23.6284933, lng: 38.0002023 }, { lat:23.6283645, lng: 37.9999148 }, { lat:23.6281928, lng: 37.9995597 }, { lat:23.6280212, lng: 37.9992723 }, { lat:23.6277422, lng: 37.9990863 }, { lat:23.6274633, lng: 37.9989679 }, { lat:23.6275277, lng: 37.996516 }, { lat:23.6270341, lng: 37.9959411 }, { lat:23.6276564, lng: 37.9952985 }, { lat:23.6265621, lng: 37.9946221 }, { lat:23.6249957, lng: 37.9944023 }, { lat:23.6297593, lng: 37.9905129 }, { lat:23.6344337, lng: 37.9884155 }, { lat:23.6347418, lng: 37.9882655 }, { lat:23.6354316, lng: 37.9879298 }, { lat:23.636717, lng: 37.9873285 }, { lat:23.6364119, lng: 37.9869388 }, { lat:23.6365457, lng: 37.9867675 }, { lat:23.6373824, lng: 37.9863558 }, { lat:23.6370477, lng: 37.9859122 }, { lat:23.6368173, lng: 37.9856044 }, { lat:23.6373024, lng: 37.9853974 }, { lat:23.6374726, lng: 37.9853169 }, { lat:23.6375909, lng: 37.9853067 }, { lat:23.6376611, lng: 37.9852756 }, { lat:23.6376718, lng: 37.985222 }, { lat:23.6376828, lng: 37.9851665 }, { lat:23.6377071, lng: 37.985137 }, { lat:23.6377664, lng: 37.9851121 }, { lat:23.6378485, lng: 37.9851663 }, { lat:23.6378998, lng: 37.9851534 }, { lat:23.6379245, lng: 37.9850849 }, { lat:23.6380582, lng: 37.9850188 }, { lat:23.639004, lng: 37.9845582 }, { lat:23.6399182, lng: 37.984113 }, { lat:23.6401312, lng: 37.9842106 }, { lat:23.6404102, lng: 37.9842952 }, { lat:23.6406352, lng: 37.9843312 }, { lat:23.6407964, lng: 37.9843544 }, { lat:23.641011, lng: 37.9844051 }, { lat:23.6412685, lng: 37.9845066 }, { lat:23.6415367, lng: 37.9846081 }, { lat:23.6417191, lng: 37.9846588 }, { lat:23.6418586, lng: 37.9846588 }, { lat:23.6420283, lng: 37.9846334 }, { lat:23.6419767, lng: 37.9842438 }, { lat:23.6419619, lng: 37.9841564 }, { lat:23.6419275, lng: 37.9840485 }, { lat:23.6418619, lng: 37.9839895 }, { lat:23.641783, lng: 37.9834181 }, { lat:23.6417367, lng: 37.9829964 }, { lat:23.6416656, lng: 37.9826916 }, { lat:23.6416597, lng: 37.9825675 }, { lat:23.6416978, lng: 37.9824266 }, { lat:23.6417474, lng: 37.9823409 }, { lat:23.6417729, lng: 37.9822923 }, { lat:23.6419178, lng: 37.9820158 }, { lat:23.6422032, lng: 37.9814713 }, { lat:23.6424601, lng: 37.9809812 }, { lat:23.6427139, lng: 37.9804971 }, { lat:23.6429464, lng: 37.9800366 }, { lat:23.6430658, lng: 37.9797972 }, { lat:23.643261, lng: 37.979422 }, { lat:23.6433046, lng: 37.9793339 }, { lat:23.6433284, lng: 37.979295 }, { lat:23.6433524, lng: 37.9792559 }, { lat:23.6436288, lng: 37.9787127 }, { lat:23.6437259, lng: 37.9785218 }, { lat:23.6439637, lng: 37.9780545 }, { lat:23.6443141, lng: 37.9773657 }, { lat:23.6445175, lng: 37.9769771 }, { lat:23.6446683, lng: 37.9766888 }, { lat:23.644701, lng: 37.9766264 }, { lat:23.6447158, lng: 37.976598 }, { lat:23.6447319, lng: 37.9765673 }, { lat:23.6449115, lng: 37.9762241 }, { lat:23.6451019, lng: 37.9758602 }, { lat:23.6452956, lng: 37.9754901 }, { lat:23.6454798, lng: 37.9751381 }, { lat:23.6457128, lng: 37.9746928 }, { lat:23.6457277, lng: 37.9746642 }, { lat:23.6457676, lng: 37.9745882 }, { lat:23.6460927, lng: 37.9739669 }, { lat:23.6461696, lng: 37.9738198 }, { lat:23.6464499, lng: 37.9732842 }, { lat:23.6465572, lng: 37.9730791 }, { lat:23.6466688, lng: 37.9728659 }, { lat:23.6468036, lng: 37.9726082 }, { lat:23.6469159, lng: 37.9723937 }, { lat:23.6470282, lng: 37.9721789 }, { lat:23.6471525, lng: 37.9719414 }, { lat:23.6473391, lng: 37.9715848 }, { lat:23.6475107, lng: 37.9712569 }, { lat:23.6476943, lng: 37.970906 }, { lat:23.6478769, lng: 37.970557 }, { lat:23.6487105, lng: 37.9708303 }, { lat:23.6493964, lng: 37.9710274 }, { lat:23.6497827, lng: 37.9711377 }, { lat:23.6502428, lng: 37.971269 }, { lat:23.6508383, lng: 37.9712999 }, { lat:23.6514314, lng: 37.9713306 }, { lat:23.6514745, lng: 37.9713338 }, { lat:23.6526463, lng: 37.9713885 }, { lat:23.6529529, lng: 37.9714016 }, { lat:23.6531546, lng: 37.9714982 }, { lat:23.6535474, lng: 37.9717052 }, { lat:23.6539924, lng: 37.9719379 }, { lat:23.6542842, lng: 37.9720541 }, { lat:23.6553079, lng: 37.9724764 }, { lat:23.6563854, lng: 37.9729106 }, { lat:23.656408, lng: 37.9728661 }, { lat:23.657101, lng: 37.9729871 }, { lat:23.6580755, lng: 37.9731304 }, { lat:23.6580589, lng: 37.9737707 }, { lat:23.6580434, lng: 37.9743641 }, { lat:23.6580279, lng: 37.9749625 }, { lat:23.6580146, lng: 37.9754736 }, { lat:23.657999, lng: 37.9759883 }, { lat:23.6579739, lng: 37.9768918 }, { lat:23.6579793, lng: 37.9769343 }, { lat:23.6580058, lng: 37.9769764 }, { lat:23.6582666, lng: 37.9773532 }, { lat:23.65867, lng: 37.9779119 }, { lat:23.6587194, lng: 37.9779821 }, { lat:23.6591552, lng: 37.9786059 }, { lat:23.6594506, lng: 37.9790167 }, { lat:23.6595107, lng: 37.9791018 }, { lat:23.6598291, lng: 37.9795632 }, { lat:23.6600866, lng: 37.979951 }, { lat:23.6605642, lng: 37.9797727 }, { lat:23.6609153, lng: 37.97965 }, { lat:23.6614072, lng: 37.9794675 }, { lat:23.6615817, lng: 37.9794028 }, { lat:23.6624042, lng: 37.9790977 }, { lat:23.6629464, lng: 37.9788873 }, { lat:23.6633694, lng: 37.9787195 }, { lat:23.6636554, lng: 37.978617 }, { lat:23.6637869, lng: 37.9786953 }, { lat:23.6642955, lng: 37.9794234 }, { lat:23.6648962, lng: 37.9803367 }, { lat:23.6645789, lng: 37.9811502 }, { lat:23.663885, lng: 37.9828874 }, { lat:23.6638153, lng: 37.9829544 }, { lat:23.6637574, lng: 37.9829209 }, { lat:23.6635981, lng: 37.9829785 }, { lat:23.6635669, lng: 37.9829898 }, { lat:23.6628219, lng: 37.9832104 }, { lat:23.6625223, lng: 37.9833128 }, { lat:23.6624166, lng: 37.9833481 }, { lat:23.6622628, lng: 37.983409 }, { lat:23.6620447, lng: 37.983522 }, { lat:23.6618847, lng: 37.9835996 }, { lat:23.6617307, lng: 37.9836722 }, { lat:23.6616959, lng: 37.9836861 }, { lat:23.6612011, lng: 37.9838669 }, { lat:23.660451, lng: 37.9841367 }, { lat:23.6596978, lng: 37.9844115 }, { lat:23.6590329, lng: 37.9846663 }, { lat:23.6581859, lng: 37.9849812 }, { lat:23.6580821, lng: 37.9849964 }, { lat:23.6579659, lng: 37.9850134 }, { lat:23.657362, lng: 37.9852317 }, { lat:23.6564887, lng: 37.9855676 }, { lat:23.6555853, lng: 37.9859273 }, { lat:23.6547135, lng: 37.9862638 }, { lat:23.6539061, lng: 37.9865771 }, { lat:23.654129, lng: 37.9869729 }, { lat:23.6529729, lng: 37.9874363 }, { lat:23.6522143, lng: 37.9877914 }, { lat:23.6514049, lng: 37.9884771 }, { lat:23.6510527, lng: 37.9887913 }, { lat:23.6506194, lng: 37.9891741 }, { lat:23.6503346, lng: 37.9894285 }, { lat:23.6499398, lng: 37.9897464 }, { lat:23.649536, lng: 37.9900984 }, { lat:23.6491364, lng: 37.9904516 }, { lat:23.6487496, lng: 37.9907847 }, { lat:23.6485129, lng: 37.9909892 }, { lat:23.6483777, lng: 37.9911061 }, { lat:23.6480804, lng: 37.9913967 }, { lat:23.6466679, lng: 37.9929987 }, { lat:23.646861, lng: 37.9937267 }, { lat:23.6470756, lng: 37.9945722 }, { lat:23.64714, lng: 37.9947743 }, { lat:23.647376, lng: 37.9950956 }, { lat:23.6475477, lng: 37.9951802 }, { lat:23.6479554, lng: 37.9952148 }, { lat:23.6482558, lng: 37.9954507 }, { lat:23.6484918, lng: 37.9957559 }, { lat:23.6486624, lng: 37.9960603 }, { lat:23.6486635, lng: 37.9968373 }, { lat:23.6489853, lng: 37.9976329 }, { lat:23.6490926, lng: 37.9977843 }, { lat:23.649157, lng: 37.9984944}
]
}`

    }
}