import { Injectable } from "@angular/core";
import { Item, Category } from "./models/eody.model";

@Injectable()
export class DataService {
    private currentTabIndex : number = 0;
    setTabIndex(idx : number):void {
        this.currentTabIndex = idx;
    }
    getActiveTab():number {
        return this.currentTabIndex;
    }

    getItems(): Array<Item> {
        return [{
            id: 1,
            name: "Σεισμοί",
            cover: "~/app/assets/images/seismoi.png",
            images: [
                "~/app/assets/images/seismoi.png",
                "~/app/assets/images/seismoi.png",
                "~/app/assets/images/seismoi.png",
                "~/app/assets/images/seismoi.png",
                "~/app/assets/images/seismoi.png",
                "~/app/assets/images/seismoi.png"
            ],
            category: "",
            categoryTag: "#2D9CDB",
            price: "300.00",
            likes: 987,
            isLike: false,
            isFavorite: true,
            comments: 13,
            rating: "4.5",
            description: `<h3>ΠΡΟΕΤΟΙΜΑΣΤΕΙΤΕ</h3>

<h4>Μέσα στο σπίτι</h4>
<p>
Στερεώστε γερά στους τοίχους τα ράφια και τις βιβλιοθήκες. Απομακρύνετε από τις πόρτες τα ψηλά έπιπλα που μπορούν να ανατραπούν και να εμποδίσουν την έξοδο.
</p><p>
Βιδώστε καλά στους τοίχους το θερμοσίφωνα και τις δεξαμενές καυσίμων και νερού.
</p><p>
Τοποθετείστε τα βαριά αντικείμενα στα χαμηλότερα ράφια.
</p><p>
Απομακρύνετε τα βαριά αντικείμενα πάνω από κρεβάτια και καναπέδες.
</p><p>
Στερεώστε καλά τα φωτιστικά σώματα και τους ανεμιστήρες οροφής.
</p><p>
Προσδιορίστε καλά προφυλαγμένους χώρους σε κάθε δωμάτιο του σπιτιού:
</p><p>
<ul>
<li>  κάτω από ανθεκτικά γραφεία ή τραπέζια.</li>

<li>  μακριά από γυάλινες επιφάνειες και βιβλιοθήκες.</li>

<li>  μακριά από εξωτερικούς τοίχους.</li>
</ul>
<p>
Ελέγξτε τη σωστή λειτουργία του δικτύου παροχής ηλεκτρικού ρεύματος και φυσικού αερίου.
</p><p>
Ενημερώστε τα μέλη της οικογένειας για το πώς κλείνουν οι γενικοί διακόπτες ηλεκτρικού, νερού και φυσικού αερίου και για τα τηλέφωνα έκτακτης ανάγκης (112, 199, 166, 100 κλπ.)
</p><p>
Προμηθευτείτε φορητό ραδιόφωνο με μπαταρίες, φακό και βαλιτσάκι πρώτων βοηθειών.
</p><h4>
Έξω από το σπίτι
</h4><p>
Επιλέξτε ένα ασφαλή χώρο συνάντησης μετά το σεισμό ο οποίος να βρίσκεται:</p>
<ul>
<li>  μακριά από κτίρια και δέντρα</li>
<li>  μακριά από τηλεφωνικά και ηλεκτρικά καλώδια.</li>
 </ul>

<h4>ΟΤΑΝ ΓΙΝΕΤΑΙ ΣΕΙΣΜΟΣ</h4>
<p>Αν είστε μέσα στο σπίτι</p><p>
Διατηρείστε την ψυχραιμία σας.
</p><p>
Καλυφθείτε κάτω από κάποιο ανθεκτικό έπιπλο (τραπέζι, γραφείο, θρανίο), γονατίστε και κρατήστε με τα χέρια σας το πόδι του.
</p><p>
Αν δεν υπάρχει ανθεκτικό έπιπλο, γονατίστε στο μέσον του δωματίου, μειώνοντας όσο γίνεται το ύψος σας και προστατέψτε με τα χέρια το κεφάλι και τον αυχένα σας. Απομακρυνθείτε από μεγάλες γυάλινες επιφάνειες (παράθυρα, γυάλινα χωρίσματα) ή έπιπλα και αντικείμενα που μπορεί να σας τραυματίσουν.
</p><p>
Μην προσπαθήσετε να απομακρυνθείτε από το σπίτι.
</p><p>
Μην βγείτε στο μπαλκόνι.
</p><p>
Αν είστε σε ψηλό κτίριο
</p><p>
Απομακρυνθείτε από τζάμια και εξωτερικούς τοίχους.
</p><p>
Αν είστε σε χώρο ψυχαγωγίας, εμπορικό κέντρο ή μεγάλο κατάστημα
</p><p>
Διατηρείστε την ψυχραιμία σας.
</p><p>
Μείνετε στο χώρο μέχρι να τελειώσει η δόνηση.
</p><p>
Μην παρασυρθείτε από το πανικόβλητο πλήθος που κινείται άτακτα προς τις εξόδους γιατί κινδυνεύετε να ποδοπατηθείτε.
</p><p>
Αν βρίσκεστε σε ανοιχτό χώρο</p><p>
Απομακρυνθείτε από χώρους που βρίσκονται κάτω από κτίρια, τηλεφωνικά ή ηλεκτρικά καλώδια.
</p><p>
Αν έχετε μαζί σας τσάντα ή χαρτοφύλακα, καλύψτε το κεφάλι σας με αυτά.
</p><p>
Αν βρίσκεστε μέσα στο αυτοκίνητο
</p><p>
Καταφύγετε σε ανοιχτό χώρο και σταματήστε με προσοχή το αυτοκίνητο ώστε να μην εμποδίζει την κυκλοφορία.
</p><p>
Αποφύγετε να περάσετε από σήραγγες, γέφυρες ή υπέργειες διαβάσεις.
</p>
 

<h4>ΤΙ ΝΑ ΚΑΝΕΤΕ ΜΕΤΑ ΤΟ ΣΕΙΣΜΟ</h4>
<p>Αν είστε μέσα στο σπίτι
</p><p>
Προετοιμαστείτε για τυχόν μετασεισμούς.
</p><p>
Ελέγξτε προσεκτικά τον εαυτό σας και τους γύρω σας για πιθανούς τραυματισμούς.
</p><p>
Αν υπάρχουν βαριά τραυματισμένοι μην τους μετακινείτε.
</p><p>
Εκκενώστε το κτίριο από το κλιμακοστάσιο (μην χρησιμοποιείτε τον ανελκυστήρα), αφού πρώτα κλείσετε τους διακόπτες του ηλεκτρικού ρεύματος, του φυσικού αερίου και του νερού.
</p><p>
Καταφύγετε σε ανοιχτό και ασφαλή χώρο.
</p><p>
Ακολουθείστε τις οδηγίες των Αρχών και μην δίνετε σημασία σε φημολογίες.
</p><p>
Μην χρησιμοποιείτε άσκοπα το αυτοκίνητό σας ώστε να μην γίνετε εμπόδιο στο έργο των συνεργείων διάσωσης.
</p><p>
Χρησιμοποιείστε το σταθερό ή κινητό τηλέφωνό σας σε εξαιρετικές περιπτώσεις, γιατί προκαλείται υπερφόρτωση των τηλεφωνικών δικτύων.
</p><p>
Αποφύγετε να μπείτε στο σπίτι σας αν βλέπετε βλάβες, κομμένα καλώδια, διαρροή υγραερίου ή φυσικού αερίου.
</p>
 
<h4>
ΠΩΣ ΝΑ ΑΝΤΙΔΡΑΣΕΤΕ ΣΕ ΕΠΕΡΧΟΜΕΝΟ ΚΥΜΑ ΒΑΡΥΤΗΤΑΣ (ΤΣΟΥΝΑΜΙ)</h4>
<p>Αν βρίσκεστε σε περιοχή παραθαλάσσια με χαμηλό υψόμετρο
</p><p>
Παρότι δεν προκαλούν τσουνάμι όλοι οι σεισμοί μείνετε σε εγρήγορση.
</p><p>
Παρατηρείστε αν υπάρχει σημαντική αύξηση ή πτώση της στάθμης του ύδατος, γεγονός που αποτελεί φυσική προειδοποίηση.
</p><p>
Απομακρυνθείτε από τη θάλασσα και κατευθυνθείτε σε περιοχές της ενδοχώρας με μεγαλύτερο υψόμετρο. Ένα τσουνάμι μικρού μεγέθους σε ένα σημείο της ακτής μπορεί να μεταβληθεί σε μεγάλο τσουνάμι, σε απόσταση χιλιομέτρων.
</p><p>
Μείνετε μακριά από την ακτή. Το τσουνάμι δεν αποτελείται μόνο από ένα μόνο κύμα αλλά από μια σειρά από κύματα οπότε επιστρέψτε μόνο αφού ενημερωθείτε από τις αρμόδιες Aρχές ότι δεν υπάρχει κίνδυνος.
</p><p>
Μην πλησιάζετε τις ακτές για να παρακολουθήσετε ένα επερχόμενο τσουνάμι. Όταν το δείτε ίσως είναι αργά για να το αποφύγετε.</p>`
        },
        {
            id: 2,
            name: "Κατολισθήσεις / Καθιζήσεις",
            cover: "~/app/assets/images/katolisthiseis_1.png",
            images: [
                "~/app/assets/images/katolisthiseis_1.png",
                "~/app/assets/images/katolisthiseis_1.png",
                "~/app/assets/images/katolisthiseis_1.png",
                "~/app/assets/images/katolisthiseis_1.png",
                "~/app/assets/images/katolisthiseis_1.png",
                "~/app/assets/images/katolisthiseis_1.png"
            ],
            category: "",
            categoryTag: "#e4ce0d",
            price: "230.00",
            likes: 891,
            isLike: true,
            isFavorite: true,
            comments: 7,
            rating: "4.0",
            description: `<h3>ΕΤΟΙΜΟΤΗΤΑ ΓΙΑ ΚΑΤΟΛΙΣΘΗΣΕΙΣ</h3>
<p>Περιοχές που ο κίνδυνος εκδήλωσης κατολίσθησης είναι αυξημένος</p><p>
Σε περιοχές υφιστάμενων παλαιότερων κατολισθήσεων.</p><p>
Πάνω ή στη βάση απότομων πρανών ή κλιτύων.</p><p>
Στη βάση ή την κορυφή επιχωμάτων και εκσκαφών.</p><p>
Η ισχυρή ανατάραξη του εδάφους που προκαλείται από τους σεισμούς μπορεί να προκαλέσει κατολισθήσεις ή να εντείνει τις συνέπειες τους.</p><p>
Ενέργειες πριν την εκδήλωση της κατολίσθησης</p><p>
Οι κατολισθήσεις συμβαίνουν συνήθως σε περιοχές που έχουν συμβεί και στο παρελθόν. Ζητήστε πληροφορίες για τις κατολισθήσεις στην περιοχή σας, και ενδεχομένως ζητήστε μια λεπτομερή πραγματογνωμοσύνη της περιοχής του  ακινήτου σας.</p><p>
Εάν η κατοικία σας βρίσκεται εντός περιοχής με αυξημένο κίνδυνο για την εκδήλωση κατολίσθησης ελαχιστοποιείστε τον κίνδυνο πραγματοποιώντας φύτευση των πρανών που βρίσκονται εντός της ιδιοκτησίας σας και κατασκευάζοντας τοίχους αντιστήριξης.</p><p>
Τι να κάνετε αν υποψιάζεστε ότι υπάρχει άμεσος κίνδυνος κατολισθήσεων</p><p>
Επικοινωνήστε με τις τοπικές Αρχές, Πυροσβεστική, Αστυνομία ή Διεύθυνση Τεχνικών Έργων. Οι τοπικοί φορείς είναι οι πλέον κατάλληλοι να εκτιμήσουν έναν ενδεχόμενο κίνδυνο.</p><p>
Ενημερώστε τους γείτονές σας. Ενδέχεται να μην έχουν επίγνωση των πιθανών κινδύνων.</p><p>
Αν βρίσκεστε σε περιοχές επικίνδυνες για κατολισθήσεις και λασποροές, ενημερωθείτε για τις πιθανές οδούς διαφυγής. Θυμηθείτε παρόλα αυτά ότι η οδήγηση κατά τη διάρκεια έντονης βροχόπτωσης είναι πολύ επικίνδυνη.</p><p>
Ενημερωθείτε από τα μέσα μαζικής ενημέρωσης και το διαδίκτυο για προειδοποιήσεις σχετικές με φαινόμενα έντονων ή παρατεταμένων βροχοπτώσεων. Μετά από περιόδους παρατεταμένων βροχοπτώσεων αυξάνεται ο κίνδυνος εκδήλωσης κατολισθήσεων.</p><p>
Ενέργειες κατά την διάρκεια εκδήλωσης κατολισθήσεων</p><p>

Απομακρυνθείτε το ταχύτερο δυνατό από την περιοχή εκδήλωσης της κατολίσθησης.</p><p>
Αν παραμείνετε στο σπίτι, μετακινηθείτε σε ψηλότερους ορόφους.</p><p>
Εάν είναι αδύνατο να απομακρυνθείτε καθίστε στο πάτωμα σε εμβρυακή στάση και προστατέψτε το κεφάλι σας.</p><p>
Να είστε έτοιμοι να μετακινηθείτε γρήγορα. Δώστε προτεραιότητα στην ασφάλεια του εαυτού σας και όχι των υπαρχόντων σας.</p><p>
Μείνετε σε ετοιμότητα και επαγρύπνηση όταν οδηγείτε. Τα κράσπεδα κατά μήκος των οδών είναι ιδιαίτερα ευαίσθητα σε κατολισθήσεις και καταπτώσεις βράχων. Παρατηρείτε με προσοχή το δρόμο για πιθανά σημάδια καθίζησης, κατάρρευσης, καταπτώσεις βράχων κλπ.</p>
 
<h4>Ενέργειες μετά την εκδήλωση κατολισθήσεων</h4>
<p>Μείνετε μακριά από την περιοχή της κατολίσθησης. Μπορεί να υπάρχει κίνδυνος εκδήλωσης νέας κατολίσθησης.</p><p>
Παρακολουθείτε τους τοπικούς ραδιοφωνικούς ή τηλεοπτικούς σταθμούς για τις τελευταίες πληροφορίες σχετικά με την αντιμετώπιση των έκτακτων αναγκών που προέκυψαν από την εκδήλωση της κατολίσθησης.</p><p>
Ελέγξτε για τραυματίες και παγιδευμένα άτομα περιμετρικά του χώρου εκδήλωσης της κατολίσθησης, χωρίς να εισέλθετε σε αυτόν. Κατευθύνεται τα σωστικά συνεργεία στις θέσεις των παγιδευμένων.</p><p>
Ελέγξτε για βλάβες σε δίκτυα κοινής ωφέλειας, οδικό και σιδηροδρομικό δίκτυο και αναφέρεται τις βλάβες στις αρμόδιες Αρχές.</p><p>
Ελέγξτε για ζημιές τα κρίσιμα σημεία για την στατικότητα του σπιτιού σας.</p>`
        },
        {
            id: 3,
            name: "Δασικές πυρκαγιές",
            cover: "~/app/assets/images/fires.png",
            images: [
                "~/app/assets/images/fires.png",
                "~/app/assets/images/fires.png",
                "~/app/assets/images/fires.png",
                "~/app/assets/images/fires.png"
            ],
            category: "",
            categoryTag: "#27AE60",
            price: "300.00",
            likes: 730,
            isLike: true,
            isFavorite: true,
            comments: 11,
            rating: "4.0",
            description: `<h3>ΠΡΟΕΤΟΙΜΑΣΤΕΙΤΕ</h3>
<p>
Αν βρίσκεστε στην ύπαιθρο</p><p>
Μην καίτε σκουπίδια ή ξερά χόρτα και κλαδιά κατά τους θερινούς μήνες.
</p><p>
Μην ανάβετε υπαίθριες ψησταριές στα δάση ή σε χώρους που υπάρχουν ξερά χόρτα το καλοκαίρι.
</p><p>
Αποφύγετε εργασίες που ενδέχεται να προκαλέσουν πυρκαγιά (π.χ. ηλεκτροκολλήσεις, χρήση τροχού ή άλλου εργαλείου που δημιουργεί σπινθήρες).
</p><p>
Μην πετάτε αναμμένα τσιγάρα.
</p><p>
Μην αφήνετε τα σκουπίδια στο δάσος. Υπάρχει κίνδυνος ανάφλεξης.
</p><p>
Σεβαστείτε τα απαγορευτικά πρόσβασης σε περιόδους υψηλού κίνδυνου.
</p><p>
 Αν το σπίτι σας βρίσκεται μέσα ή κοντά σε δάσος</p><p>
Δημιουργείστε μια αντιπυρική ζώνη γύρω από το σπίτι καθαρίζοντας σε ακτίνα τουλάχιστον 10 μέτρων τα ξερά χόρτα και φύλλα, τις πευκοβελόνες και τα κλαδιά.
</p><p>
Κλαδέψτε τα δένδρα μέχρι το ύψος των 3 μέτρων, ανάλογα με την ηλικία και την κατάστασή τους.
</p><p>
Απομακρύνετε τα ξερά κλαδιά από τα δένδρα και τους θάμνους.
</p><p>
Μην αφήνετε τα κλαδιά των δένδρων να ακουμπούν στους τοίχους, τη στέγη και τα μπαλκόνια του σπιτιού. Κλαδέψτε τα αφήνοντας απόσταση τουλάχιστον 5 μέτρων από το σπίτι.
</p><p>
Αραιώστε τη δενδρώδη βλάστηση έτσι ώστε τα κλαδιά του ενός δένδρου να απέχουν τουλάχιστον 3 μέτρα από τα κλαδιά του άλλου. Για ακόμη μεγαλύτερη προστασία απομακρύνουμε τη δενδρώδη και θαμνώδη βλάστηση γύρω από το κτίσμα σε απόσταση τουλάχιστον 10 μέτρων εφόσον οι εργασίες καθαρισμού της φυσικής βλάστησης που επιβάλλονται για την προστασία των κτιρίων δεν προσκρούουν σε καμία περίπτωση στις διατάξεις της δασικής νομοθεσίας.
</p><p>
Μην τοποθετείτε πλαστικές υδρορροές ή σωλήνες στους τοίχους του σπιτιού.
</p><p>
Μην τοποθετείτε παραθυρόφυλλα από εύφλεκτα υλικά στα παράθυρα και τις μπαλκονόπορτες.
</p><p>
Φροντίστε ώστε τα καλύμματα στις καμινάδες και τους αεραγωγούς του σπιτιού να είναι από άφλεκτο υλικό ώστε να μην διεισδύσουν σπίθες.
</p><p>
Μην αποθηκεύετε εύφλεκτα αντικείμενα κοντά στο σπίτι.
</p><p>
Τοποθετείτε τα καυσόξυλα σε κλειστούς και προφυλαγμένους χώρους.
</p><p>
Μην κατασκευάζετε ακάλυπτες δεξαμενές καυσίμου κοντά στο σπίτι.
</p><p>
Προμηθευτείτε τους κατάλληλους πυροσβεστήρες και φροντίζετε για τη συντήρησή τους.
</p><p>
Εξοπλιστείτε με σωλήνα ποτίσματος με μήκος ανάλογο της περιοχής που θέλετε να προστατεύσετε.
</p><p>
Εξοπλιστείτε με μια δεξαμενή νερού, μια απλή αντλία που λειτουργεί χωρίς ηλεκτρικό ρεύμα και ένα σωλήνα νερού.
</p><p>
Μόλις αντιληφθείτε μια πυρκαγιά
</p><p>
Τηλεφωνήστε <b>ΑΜΕΣΩΣ</b> στην Πυροσβεστική Υπηρεσία (τηλ.199) και δώστε σαφείς πληροφορίες για:
</p><ul>
<li>   την τοποθεσία και το ακριβές σημείο που βρίσκεστε,</li>
<li>   την τοποθεσία, το ακριβές σημείο και την κατεύθυνση της πυρκαγιάς.</li>
<li>   το είδος της βλάστησης που καίγεται.</li>
</ul>
<h4>ΠΡΟΕΤΟΙΜΑΣΤΕΙΤΕ</h4>
<p>
Αν η πυρκαγιά πλησιάζει στο σπίτι σας</p><p>
Διατηρείστε την ψυχραιμία σας.
</p><p>
Μεταφέρετε όλα τα εύφλεκτα υλικά από τον περίγυρο του κτιρίου σε κλειστούς και προφυλαγμένους χώρους.
</p><p>
Κλείστε όλες τις διόδους (καμινάδες, παράθυρα, πόρτες κλπ.) έτσι ώστε να μην διεισδύσουν οι καύτρες στο εσωτερικό του σπιτιού.
</p><p>
Κλείστε τις παροχές φυσικού αερίου και υγρών καυσίμων μέσα και έξω από το σπίτι.
</p><p>
Μαζέψτε τις τέντες στα μπαλκόνια και στα παράθυρα.
</p><p>
Διευκολύνετε την πρόσβαση πυροσβεστικών οχημάτων ανοίγοντας την πόρτα του κήπου.
</p><p>
Τοποθετείστε σκάλα στην εξωτερική πλευρά του σπιτιού, αντίθετα από την κατεύθυνση της πυρκαγιάς ώστε να υπάρχει η δυνατότητα άμεσης πρόσβασης στη στέγη.
</p><p>
Συνδέστε τους σωλήνες ποτίσματος και απλώστε τους ώστε να καλύπτεται η περίμετρος του σπιτιού.
</p><p>
Αν η ορατότητα είναι μειωμένη, ανάψτε τα εσωτερικά και τα εξωτερικά φώτα του για να γίνεται ορατό μέσα από τους καπνούς.
</p><p>
Μόλις περάσει η πυρκαγιά
</p><p>
Βγείτε από το σπίτι και σβήστε αμέσως τις μικροεστίες που απομένουν.
</p><p>
Ελέγξτε για τουλάχιστον 48 ώρες, ανά τακτά χρονικά διαστήματα, την περίμετρο και τους εξωτερικούς χώρους του σπιτιού για το ενδεχόμενο αναζωπυρώσεων.
</p><p>
Αν η πυρκαγιά έχει φτάσει στο σπίτι σας
</p><p>
Μην εγκαταλείπετε το κτίριο εκτός αν η διαφυγή σας είναι πλήρως εξασφαλισμένη.
</p><p>
Μην μπαίνετε μέσα σε αυτοκίνητο. Η πιθανότητα επιβίωσης σε ένα σπίτι κατασκευασμένο από άφλεκτα υλικά είναι πολύ μεγαλύτερη από εκείνη σε ένα αυτοκίνητο που βρίσκεται σε καπνούς και φλόγες.
</p><p>
Αν παραμείνετε στο σπίτι:</p>
<ul>
<li>  Κλείστε καλά τις πόρτες και τα παράθυρα.</li>
<li>  Φράξτε τις χαραμάδες με βρεγμένα πανιά για να μην μπει μέσα ο καπνός.</li>
<li>  Απομακρύνετε τις κουρτίνες από τα παράθυρα.</li>
<li>  Μεταφέρετε στο εσωτερικό των δωματίων τα έπιπλα που βρίσκονται κοντά στα παράθυρα και τις εξωτερικές πόρτες.</li>
<li>  Κλείστε τις ενδιάμεσες πόρτες για να επιβραδύνετε την εξάπλωση της πυρκαγιάς.</li>
<li>  Γεμίστε την μπανιέρα, τους νιπτήρες και τους κουβάδες με εφεδρικό νερό.</li>
<li>  Συγκεντρωθείτε όλοι μαζί σε ένα δωμάτιο.</li>
<li  Φροντίστε να υπάρχει φακός και εφεδρικές μπαταρίες μαζί σας σε περίπτωση διακοπής ηλεκτρικού ρεύματος.</li>
</ul>
<p>
Αν το σπίτι σας είναι ξύλινο αναζητείστε καταφύγιο σε κτιστό σπίτι.</p>
<p>
Αν διαταχθεί οργανωμένη απομάκρυνση από την περιοχή ακολουθείστε πιστά τις οδηγίες των Αρχών και τις διαδρομές που θα σας δοθούν.</p>`
        },
        {
            id: 5,
            name: "Απινιδωτές",
            cover: "~/app/assets/images/zoll-aed-plus.jpg",
            images: [
                "~/app/assets/images/zoll-aed-plus1.jpg",
                "~/app/assets/images/zoll-aed-plus2.jpg",
                "~/app/assets/images/zoll-aed-plus3.jpg",
                "~/app/assets/images/zoll-aed-plus1.jpg",
                "~/app/assets/images/zoll-aed-plus2.jpg",
            ],
            category: "",
            categoryTag: "#2D9CDB",
            price: "300.00",
            likes: 987,
            isLike: false,
            isFavorite: true,
            comments: 13,
            rating: "4.5",
            description: `<h3>Σημεία & Οδηγίες Χρήσης</h3>

<p>Σημεία εγκατεστημένων απινιδωτών:</p>
<p>1. Δημαρχείο Κορυδαλλού - Γρ. Λαμπράκη 240 </p>
<p>2. Κλειστό Γήπεδο "Θεόδωρος Πούτος" - Σολωμού 80</p>
<p>3. Κλειστό Γήπεδο</p>
<p>4. ΕΑΚ Κορυδαλλού- Πλαταιών</p>
<p>5. Δημοτικό Γυμναστήριο - Κουντουριώτου 25</p>

            <h4>Οδηγίες Χρήσης Απινιδωτή</h4>
            <p>1. Βεβαιώσου ότι είναι ασφαλές να προσεγγίσεις</p>
            <p>2. Έλεγξε αν το θύμα ανταποκρίνεται</p>
            <ul>
                <li>Κούνησε μαλακά τους ώμους</li>
                <li>Ρώτησε δυνατά: Είστε καλά;<li>
            </ul>
            <p>3. Εάν δεν ανταποκρίνεται</p>
            <ul>
                <li>Τοποθέτησε το χέρι στο μέτωπο του, γύρε το κεφάλι προς τα πίσω με τα δάκτυλα του άλλου χεριού κάτω από το πηγούνι ανύψωσέ το</li>
                <li>Έλεγξε για αναπνοή: ΒΛΕΠΩ, ΑΚΟΥΩ, ΑΙΣΘΑΝΟΜΑΙ</li>
            <p>Αν η αναπνοή δεν είναι φυσιολογική</p>
            <ul>
                <li>Κάλεσε 166 και ανέφερε ότι το θύμα δεν αναπνέει, δήλωσε το όνομά σου και την τοποθεσία</li>
                <li>Αν κάποιος έχει έρθει να βοηθήσει, ζήτησε να καλέσει το ασθενοφόρο και να φέρει τον Αυτόματο Εξωτερικό Απινιδωτή (ΑΕΑ)</li>
            </ul>
            <p>Συμπίεσε</p>
            <ul>
                <li>Τοποθέτησε την παλάμη του ενός χεριού στο κέντρο του θώρακα,  το άλλο χέρι από πάνω και πλέξε τα δάκτυλά σου</li>
                <li>Πίεσε δυνατά και γρήγορα τον θώρακα στο ρυθμό του “Stayin Alive”,  μέχρι να είναι διαθέσιμος ΑΕΑ ή μέχρι να φτάσει το ασθενοφόρο</li>
                <li>Αν είσαι εκπαιδευμένος δώσε 2 εμφυσήσεις για κάθε 30 συμπιέσεις, αλλιώς συνέχισε μόνο συμπιέσεις στο θώρακα</li>
            </ul>
            <p>Απινίδωσε</p>
            <ul>
                <li>Ενεργοποίησε τον ΑΕΑ, μόλις φτάσει και ακολούθησε τις οδηγίες</li>
                <li>Τοποθέτησε το ένα αυτοκόλλητο ηλεκτρόδιο κάτω από την αριστερή μασχάλη και το άλλο κάτω από τη δεξιά κλείδα, δίπλα στο στέρνο</li>
            </ul>
            <p>Εάν ενδείκνυται απινίδωση</p>
            <ul>
                <li>Βεβαιώσου ότι κανείς δεν ακουμπάει το θύμα και χορήγησε απινίδωση</li>
                <li>Συνέχισε ΚΑΡΠΑ, εκτός και εάν είσαι βέβαιος ότι το θύμα ξεκινά να αναπνέει φυσιολογικά</li>
            </ul>
            <p>Εάν δεν ενδείκνυται απινίδωση</p>
            <ul>
                <li>Συνέχισε ΚΑΡΠΑ, εκτός και εάν είσαι βέβαιος ότι το θύμα ξεκινά να αναπνέει φυσιολογικά</li>
            </ul>
            <p>Καθώς φτάνει το ασθενοφόρο συνέχισε, μέχρι να σου πουν να σταματήσεις</p>
            
            <p>Αν η αναπνοή είναι φυσιολογική</p>
            <ul>
                <li>Τοποθέτησε το θύμα σε πλάγια θέση ανάνηψης</li>
                <li>Κάλεσε το 166, στείλε κάποιον να φέρει ΑΕΑ</li>
                <li>Συνέχισε να εκτιμάς ότι η αναπνοή παραμένει φυσιολογική</li>
            </ul>
            `
        }, 

{
            id: 6,
            name: "Σημεία Ασύρματης Πρόσβασης",
            cover: "~/app/assets/images/wifi.png",
            images: [
                "~/app/assets/images/wifidimarxio1.jpg",
                "~/app/assets/images/wifidimarxio4.jpg",
                "~/app/assets/images/wifidimarxio5.png",
                "~/app/assets/images/wifidimarxio2.jpg",
                "~/app/assets/images/wifidimarxio3.jpg",

            ],
            category: "",
            categoryTag: "#2D9CDB",
            price: "300.00",
            likes: 987,
            isLike: false,
            isFavorite: true,
            comments: 13,
            rating: "4.5",
            description: `<h3>Σημεία Ασύρματης Πρόσβασης</h3>
            <p>Ο Δήμος Κορυδαλλού ενσωματώνει στη καθημερινή λειτουργία του τις νέες Τεχνολογίες Πληροφορικής ώστε να εξυπηρετεί όλο και πιο αποτελεσματικά τους δημότες και τις επιχειρήσεις.</p>
            <p>Σε αυτό το πλαίσιο, στο Δημαρχείο Κορυδαλλού έχει εγκατασταθεί και παρέχεται ελεύθερη ασύρματη πρόσβαση στο διαδίκτυο, όπου οι επισκέπτες μπορούν να συνδεθούν μέσω wifi στο κινητό, στο tablet ή στο laptop τους.</p>
            <p>Στο επόμενο χρονικό διάστημα η ελεύθερη πρόσβαση σε υπηρεσίες ασύρματου δικτύου θα επεκταθεί και σε άλλα σημεία της πόλης μας καθώς ο Δήμος Κορυδαλλού διεκδίκησε και εξασφάλισε χρηματοδότηση, κατόπιν υποβολής αιτήματος στην πρόσκληση της Ευρωπαϊκής Ένωσης για την υλοποίηση της δράσης WiFi4EU, με στόχο την ανάπτυξη των ευρυζωνικών υποδομών και του ασύρματου δικτύου υψηλών ταχυτήτων για τους δημότες και τους επισκέπτες του δήμου.</p>
            `
        }           
    
    ];
    }

    getCategories(): Array<Category> {
        return [
            {
                cover: "~/app/assets/images/food/burger640.jpg",
                category: "BURGER",
                count: "13",
            },
            {
                cover: "~/app/assets/images/food/pancake640.jpg",
                category: "PANCAKE",
                count: "5",
            },
            {
                cover: "~/app/assets/images/food/cake640.jpg",
                category: "CAKE",
                count: "9",
            },
            {
                cover: "~/app/assets/images/food/beer640.jpg",
                category: "BEER",
                count: "7",
            }
        ];
    }
}

export class KorydallosBoundaries {
    static getData() {
        return `
     {
        id: 1,
fillColor: new Color("red"),
fillOpacity: 0.7,


strokeColor: new Color("green"),
strokeWidth: 8,
strokeOpacity: 0.5,
points: [
{ lat: 23.649157, lng: 37.9984944  },{lat: 23.6490701, lng: 37.9988487 }, { lat:23.648642, lng: 37.9991877 }, { lat:23.6482772, lng: 37.9995259 }, { lat:23.6478695, lng: 37.999881 }, { lat:23.6474677, lng: 38.0002212 }, { lat:23.6468825, lng: 38.0005742 }, { lat:23.646625, lng: 38.0007433 }, { lat:23.6463675, lng: 38.0010477 }, { lat:23.645654, lng: 38.0029854 }, { lat:23.6438999, lng: 38.0033134 }, { lat:23.6437282, lng: 38.0032965 }, { lat:23.642312, lng: 38.0029583 }, { lat:23.6402521, lng: 38.0026878 }, { lat:23.640016, lng: 38.0026878 }, { lat:23.6396512, lng: 38.0027724 }, { lat:23.6392865, lng: 38.0028062 }, { lat:23.6389431, lng: 38.0028062 }, { lat:23.6385354, lng: 38.0028231 }, { lat:23.6383423, lng: 38.0029414 }, { lat:23.6380419, lng: 38.0030936 }, { lat:23.6377115, lng: 38.0031773 }, { lat:23.6365849, lng: 38.0031705 }, { lat:23.6363468, lng: 38.0035332 }, { lat:23.6359176, lng: 38.0034656 }, { lat:23.6353812, lng: 38.0032796 }, { lat:23.6350164, lng: 38.0030598 }, { lat:23.6332139, lng: 38.0030429 }, { lat:23.6321196, lng: 38.0036854 }, { lat:23.6318192, lng: 38.0024173 }, { lat:23.6307506, lng: 38.0013427 }, { lat:23.6290297, lng: 38.0006419 }, { lat:23.6287078, lng: 38.0004728 }, { lat:23.6284933, lng: 38.0002023 }, { lat:23.6283645, lng: 37.9999148 }, { lat:23.6281928, lng: 37.9995597 }, { lat:23.6280212, lng: 37.9992723 }, { lat:23.6277422, lng: 37.9990863 }, { lat:23.6274633, lng: 37.9989679 }, { lat:23.6275277, lng: 37.996516 }, { lat:23.6270341, lng: 37.9959411 }, { lat:23.6276564, lng: 37.9952985 }, { lat:23.6265621, lng: 37.9946221 }, { lat:23.6249957, lng: 37.9944023 }, { lat:23.6297593, lng: 37.9905129 }, { lat:23.6344337, lng: 37.9884155 }, { lat:23.6347418, lng: 37.9882655 }, { lat:23.6354316, lng: 37.9879298 }, { lat:23.636717, lng: 37.9873285 }, { lat:23.6364119, lng: 37.9869388 }, { lat:23.6365457, lng: 37.9867675 }, { lat:23.6373824, lng: 37.9863558 }, { lat:23.6370477, lng: 37.9859122 }, { lat:23.6368173, lng: 37.9856044 }, { lat:23.6373024, lng: 37.9853974 }, { lat:23.6374726, lng: 37.9853169 }, { lat:23.6375909, lng: 37.9853067 }, { lat:23.6376611, lng: 37.9852756 }, { lat:23.6376718, lng: 37.985222 }, { lat:23.6376828, lng: 37.9851665 }, { lat:23.6377071, lng: 37.985137 }, { lat:23.6377664, lng: 37.9851121 }, { lat:23.6378485, lng: 37.9851663 }, { lat:23.6378998, lng: 37.9851534 }, { lat:23.6379245, lng: 37.9850849 }, { lat:23.6380582, lng: 37.9850188 }, { lat:23.639004, lng: 37.9845582 }, { lat:23.6399182, lng: 37.984113 }, { lat:23.6401312, lng: 37.9842106 }, { lat:23.6404102, lng: 37.9842952 }, { lat:23.6406352, lng: 37.9843312 }, { lat:23.6407964, lng: 37.9843544 }, { lat:23.641011, lng: 37.9844051 }, { lat:23.6412685, lng: 37.9845066 }, { lat:23.6415367, lng: 37.9846081 }, { lat:23.6417191, lng: 37.9846588 }, { lat:23.6418586, lng: 37.9846588 }, { lat:23.6420283, lng: 37.9846334 }, { lat:23.6419767, lng: 37.9842438 }, { lat:23.6419619, lng: 37.9841564 }, { lat:23.6419275, lng: 37.9840485 }, { lat:23.6418619, lng: 37.9839895 }, { lat:23.641783, lng: 37.9834181 }, { lat:23.6417367, lng: 37.9829964 }, { lat:23.6416656, lng: 37.9826916 }, { lat:23.6416597, lng: 37.9825675 }, { lat:23.6416978, lng: 37.9824266 }, { lat:23.6417474, lng: 37.9823409 }, { lat:23.6417729, lng: 37.9822923 }, { lat:23.6419178, lng: 37.9820158 }, { lat:23.6422032, lng: 37.9814713 }, { lat:23.6424601, lng: 37.9809812 }, { lat:23.6427139, lng: 37.9804971 }, { lat:23.6429464, lng: 37.9800366 }, { lat:23.6430658, lng: 37.9797972 }, { lat:23.643261, lng: 37.979422 }, { lat:23.6433046, lng: 37.9793339 }, { lat:23.6433284, lng: 37.979295 }, { lat:23.6433524, lng: 37.9792559 }, { lat:23.6436288, lng: 37.9787127 }, { lat:23.6437259, lng: 37.9785218 }, { lat:23.6439637, lng: 37.9780545 }, { lat:23.6443141, lng: 37.9773657 }, { lat:23.6445175, lng: 37.9769771 }, { lat:23.6446683, lng: 37.9766888 }, { lat:23.644701, lng: 37.9766264 }, { lat:23.6447158, lng: 37.976598 }, { lat:23.6447319, lng: 37.9765673 }, { lat:23.6449115, lng: 37.9762241 }, { lat:23.6451019, lng: 37.9758602 }, { lat:23.6452956, lng: 37.9754901 }, { lat:23.6454798, lng: 37.9751381 }, { lat:23.6457128, lng: 37.9746928 }, { lat:23.6457277, lng: 37.9746642 }, { lat:23.6457676, lng: 37.9745882 }, { lat:23.6460927, lng: 37.9739669 }, { lat:23.6461696, lng: 37.9738198 }, { lat:23.6464499, lng: 37.9732842 }, { lat:23.6465572, lng: 37.9730791 }, { lat:23.6466688, lng: 37.9728659 }, { lat:23.6468036, lng: 37.9726082 }, { lat:23.6469159, lng: 37.9723937 }, { lat:23.6470282, lng: 37.9721789 }, { lat:23.6471525, lng: 37.9719414 }, { lat:23.6473391, lng: 37.9715848 }, { lat:23.6475107, lng: 37.9712569 }, { lat:23.6476943, lng: 37.970906 }, { lat:23.6478769, lng: 37.970557 }, { lat:23.6487105, lng: 37.9708303 }, { lat:23.6493964, lng: 37.9710274 }, { lat:23.6497827, lng: 37.9711377 }, { lat:23.6502428, lng: 37.971269 }, { lat:23.6508383, lng: 37.9712999 }, { lat:23.6514314, lng: 37.9713306 }, { lat:23.6514745, lng: 37.9713338 }, { lat:23.6526463, lng: 37.9713885 }, { lat:23.6529529, lng: 37.9714016 }, { lat:23.6531546, lng: 37.9714982 }, { lat:23.6535474, lng: 37.9717052 }, { lat:23.6539924, lng: 37.9719379 }, { lat:23.6542842, lng: 37.9720541 }, { lat:23.6553079, lng: 37.9724764 }, { lat:23.6563854, lng: 37.9729106 }, { lat:23.656408, lng: 37.9728661 }, { lat:23.657101, lng: 37.9729871 }, { lat:23.6580755, lng: 37.9731304 }, { lat:23.6580589, lng: 37.9737707 }, { lat:23.6580434, lng: 37.9743641 }, { lat:23.6580279, lng: 37.9749625 }, { lat:23.6580146, lng: 37.9754736 }, { lat:23.657999, lng: 37.9759883 }, { lat:23.6579739, lng: 37.9768918 }, { lat:23.6579793, lng: 37.9769343 }, { lat:23.6580058, lng: 37.9769764 }, { lat:23.6582666, lng: 37.9773532 }, { lat:23.65867, lng: 37.9779119 }, { lat:23.6587194, lng: 37.9779821 }, { lat:23.6591552, lng: 37.9786059 }, { lat:23.6594506, lng: 37.9790167 }, { lat:23.6595107, lng: 37.9791018 }, { lat:23.6598291, lng: 37.9795632 }, { lat:23.6600866, lng: 37.979951 }, { lat:23.6605642, lng: 37.9797727 }, { lat:23.6609153, lng: 37.97965 }, { lat:23.6614072, lng: 37.9794675 }, { lat:23.6615817, lng: 37.9794028 }, { lat:23.6624042, lng: 37.9790977 }, { lat:23.6629464, lng: 37.9788873 }, { lat:23.6633694, lng: 37.9787195 }, { lat:23.6636554, lng: 37.978617 }, { lat:23.6637869, lng: 37.9786953 }, { lat:23.6642955, lng: 37.9794234 }, { lat:23.6648962, lng: 37.9803367 }, { lat:23.6645789, lng: 37.9811502 }, { lat:23.663885, lng: 37.9828874 }, { lat:23.6638153, lng: 37.9829544 }, { lat:23.6637574, lng: 37.9829209 }, { lat:23.6635981, lng: 37.9829785 }, { lat:23.6635669, lng: 37.9829898 }, { lat:23.6628219, lng: 37.9832104 }, { lat:23.6625223, lng: 37.9833128 }, { lat:23.6624166, lng: 37.9833481 }, { lat:23.6622628, lng: 37.983409 }, { lat:23.6620447, lng: 37.983522 }, { lat:23.6618847, lng: 37.9835996 }, { lat:23.6617307, lng: 37.9836722 }, { lat:23.6616959, lng: 37.9836861 }, { lat:23.6612011, lng: 37.9838669 }, { lat:23.660451, lng: 37.9841367 }, { lat:23.6596978, lng: 37.9844115 }, { lat:23.6590329, lng: 37.9846663 }, { lat:23.6581859, lng: 37.9849812 }, { lat:23.6580821, lng: 37.9849964 }, { lat:23.6579659, lng: 37.9850134 }, { lat:23.657362, lng: 37.9852317 }, { lat:23.6564887, lng: 37.9855676 }, { lat:23.6555853, lng: 37.9859273 }, { lat:23.6547135, lng: 37.9862638 }, { lat:23.6539061, lng: 37.9865771 }, { lat:23.654129, lng: 37.9869729 }, { lat:23.6529729, lng: 37.9874363 }, { lat:23.6522143, lng: 37.9877914 }, { lat:23.6514049, lng: 37.9884771 }, { lat:23.6510527, lng: 37.9887913 }, { lat:23.6506194, lng: 37.9891741 }, { lat:23.6503346, lng: 37.9894285 }, { lat:23.6499398, lng: 37.9897464 }, { lat:23.649536, lng: 37.9900984 }, { lat:23.6491364, lng: 37.9904516 }, { lat:23.6487496, lng: 37.9907847 }, { lat:23.6485129, lng: 37.9909892 }, { lat:23.6483777, lng: 37.9911061 }, { lat:23.6480804, lng: 37.9913967 }, { lat:23.6466679, lng: 37.9929987 }, { lat:23.646861, lng: 37.9937267 }, { lat:23.6470756, lng: 37.9945722 }, { lat:23.64714, lng: 37.9947743 }, { lat:23.647376, lng: 37.9950956 }, { lat:23.6475477, lng: 37.9951802 }, { lat:23.6479554, lng: 37.9952148 }, { lat:23.6482558, lng: 37.9954507 }, { lat:23.6484918, lng: 37.9957559 }, { lat:23.6486624, lng: 37.9960603 }, { lat:23.6486635, lng: 37.9968373 }, { lat:23.6489853, lng: 37.9976329 }, { lat:23.6490926, lng: 37.9977843 }, { lat:23.649157, lng: 37.9984944}
]
}`

    }
}